/******************** (C) COPYRIGHT 2015 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：key.h
 * 描	述	：
 *                    
 * 实验平台	：FCU V1.0
 * 硬件连接	：
 * 版 	本	：V1.0.150411
 * 从属关系	：FCU_UCOSII150602_UCOSII2.91
 * 库版本	：ST3.0.0
 * 创建时间	：2014.4.11
 * 最后编辑	：2015.4.11
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/

#ifndef __KEY_H_
#define __KEY_H_

/****************************包含头文件*******************************************/
#include "stm32f10x.h"
//#include "Project_cfg.h"
/****************************宏定义***********************************************/
#define KEY_CLK			RCC_APB2Periph_GPIOB
#define KEY_PORT		GPIOB
#define KEY_MODE_Pin	GPIO_Pin_1
#define KEY_FUNC_Pin	GPIO_Pin_3

#define KEY_MODE_Val GPIO_ReadInputDataBit(KEY_PORT,KEY_MODE_Pin)
#define KEY_FUNC_Val GPIO_ReadInputDataBit(KEY_PORT,KEY_FUNC_Pin)
/****************************类型定义*********************************************/

/****************************变量声明*********************************************/

/****************************变量定义*********************************************/

/****************************函数声明*********************************************/
void KEY_GPIO_Config(void);

#endif
/******************* (C) COPYRIGHT 2015 DammStanger *****END OF FILE************/
