/******************** (C) COPYRIGHT 2015 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：EXTI.c
 * 描	述	：外部中断初始化和中断服务
 *                    
 * 实验平台	：FCU V1.0
 * 硬件连接	：
 * 版 	本	：V1.0.150412
 * 从属关系	：FCU_UCOSII150602_UCOSII2.91
 * 库版本	：ST3.0.0
 * 创建时间	：2014.4.11
 * 最后编辑	：2015.4.12
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/



/****************************包含头文件*******************************************/
#include "key.h"

/****************************宏定义***********************************************/

/****************************变量声明*********************************************/

/****************************变量定义*********************************************/

/****************************函数声明*********************************************/

///********************************************************************************
// * 函数名：KEY_GPIO_Config()
// * 描述  ：key引脚初始化
// * 输入  ：-		    	
// * 返回  ：-
// * 调用  ：外部
// ********************************************************************************/
void KEY_GPIO_Config(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	//配置失能JTAG功能
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);      /*使能SWD 禁用JTAG*/
	
	RCC_APB2PeriphClockCmd( KEY_CLK, ENABLE);
	
    GPIO_InitStructure.GPIO_Pin = KEY_MODE_Pin|KEY_FUNC_Pin;	
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;       
    GPIO_Init(KEY_PORT, &GPIO_InitStructure);

}



		
/******************* (C) COPYRIGHT 2015 DammStanger *****END OF FILE************/
