/******************** (C) COPYRIGHT 2015 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：RCencode.h
 * 描	述	：外部中断初始化和中断服务
 *                    
 * 实验平台	：FCU V1.0
 * 硬件连接	：
 * 版 	本	：V1.0.150411
 * 从属关系	：FCU_UCOSII150602_UCOSII2.91
 * 库版本	：ST3.0.0
 * 创建时间	：2014.4.11
 * 最后编辑	：2015.4.11
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/

#ifndef __RCENCODE_H_
#define __RCENCODE_H_

/****************************包含头文件*******************************************/
#include "stm32f10x.h"
//#include "Project_cfg.h"
/****************************宏定义***********************************************/

/****************************类型定义*********************************************/
typedef struct 
{
	u16 ROLL;
	u16 PITCH;
	u16 THROTTLE;
	u16 YAW;
	u16 MODE;
	u16 FUNC;
}RC_DATA;

typedef struct 
{
	float ROLL;
	float PITCH;
	float THROTTLE;
	float YAW;
	float MODE;
	float FUNC;
}RC_DATA_f;
/****************************变量声明*********************************************/
extern RC_DATA RC_dat;
/****************************变量定义*********************************************/

/****************************函数声明*********************************************/
u8 RC_Adc_Calib(u16 *pval);
void RC_RCdat_pkg(u16 *pval);
#endif
/******************* (C) COPYRIGHT 2015 DammStanger *****END OF FILE************/
